; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	spectrograph0 - mode
	thermograph3 - mode
	image2 - mode
	image1 - mode
	infrared4 - mode
	Star3 - direction
	Star1 - direction
	Star5 - direction
	GroundStation0 - direction
	GroundStation4 - direction
	GroundStation2 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Planet11 - direction
	Star12 - direction
	Star13 - direction
	Planet14 - direction
)
(:init
	(supports instrument0 thermograph3)
	(supports instrument0 infrared4)
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation4)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 infrared4)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 GroundStation0)
	(calibration_target instrument1 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star3)
	(supports instrument2 image2)
	(supports instrument2 infrared4)
	(supports instrument2 thermograph3)
	(calibration_target instrument2 GroundStation0)
	(supports instrument3 infrared4)
	(supports instrument3 spectrograph0)
	(supports instrument3 image1)
	(calibration_target instrument3 Star5)
	(supports instrument4 thermograph3)
	(supports instrument4 image1)
	(supports instrument4 spectrograph0)
	(calibration_target instrument4 GroundStation4)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star1)
	(supports instrument5 infrared4)
	(supports instrument5 spectrograph0)
	(supports instrument5 thermograph3)
	(calibration_target instrument5 GroundStation2)
	(supports instrument6 image2)
	(supports instrument6 spectrograph0)
	(calibration_target instrument6 GroundStation4)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet11)
	(supports instrument7 image2)
	(calibration_target instrument7 GroundStation4)
	(calibration_target instrument7 GroundStation0)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet6)
	(supports instrument8 image2)
	(calibration_target instrument8 GroundStation2)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star5)
)
(:goal (and
	(pointing satellite0 GroundStation4)
	(pointing satellite2 Planet11)
	(pointing satellite4 GroundStation0)
	(have_image Planet6 image1)
	(have_image Phenomenon7 infrared4)
	(have_image Phenomenon8 spectrograph0)
	(have_image Phenomenon9 infrared4)
	(have_image Planet10 spectrograph0)
	(have_image Planet11 image1)
	(have_image Star12 image1)
	(have_image Star13 thermograph3)
	(have_image Planet14 spectrograph0)
))

)

; plan
1. (turn_to satellite4 groundstation0 star5)
   deleted: (pointing satellite4 star5)
   added: (pointing satellite4 groundstation0)
   goals met: 2 of 12
2. (turn_to satellite1 star5 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 star5)
   goals met: 2 of 12
3. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 2 of 12
4. (calibrate satellite1 instrument3 star5)
   added: (calibrated instrument3)
   goals met: 2 of 12
5. (turn_to satellite1 phenomenon9 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 phenomenon9)
   goals met: 2 of 12
6. (take_image satellite1 phenomenon9 instrument3 infrared4)
   added: (have_image phenomenon9 infrared4)
   goals met: 3 of 12
7. (turn_to satellite1 phenomenon8 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 phenomenon8)
   goals met: 3 of 12
8. (take_image satellite1 phenomenon8 instrument3 spectrograph0)
   added: (have_image phenomenon8 spectrograph0)
   goals met: 4 of 12
9. (turn_to satellite1 phenomenon7 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 phenomenon7)
   goals met: 4 of 12
10. (turn_to satellite0 groundstation2 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 groundstation2)
   goals met: 4 of 12
11. (take_image satellite1 phenomenon7 instrument3 infrared4)
   added: (have_image phenomenon7 infrared4)
   goals met: 5 of 12
12. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 5 of 12
13. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 5 of 12
14. (turn_to satellite0 planet11 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 planet11)
   goals met: 5 of 12
15. (take_image satellite0 planet11 instrument0 image1)
   added: (have_image planet11 image1)
   goals met: 6 of 12
16. (turn_to satellite0 planet6 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet6)
   goals met: 6 of 12
17. (take_image satellite0 planet6 instrument0 image1)
   added: (have_image planet6 image1)
   goals met: 7 of 12
18. (turn_to satellite0 star12 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star12)
   goals met: 7 of 12
19. (take_image satellite0 star12 instrument0 image1)
   added: (have_image star12 image1)
   goals met: 8 of 12
20. (turn_to satellite0 star13 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star13)
   goals met: 8 of 12
21. (take_image satellite0 star13 instrument0 thermograph3)
   added: (have_image star13 thermograph3)
   goals met: 9 of 12
22. (turn_to satellite0 groundstation4 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 groundstation4)
   goals met: 10 of 12
23. (turn_to satellite1 planet10 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 planet10)
   goals met: 10 of 12
24. (take_image satellite1 planet10 instrument3 spectrograph0)
   added: (have_image planet10 spectrograph0)
   goals met: 11 of 12
25. (turn_to satellite1 planet14 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 planet14)
   goals met: 11 of 12
26. (take_image satellite1 planet14 instrument3 spectrograph0)
   added: (have_image planet14 spectrograph0)
   goals met: 12 of 12
